#include <stdio.h>
#include <stdlib.h>

/*
输出二维数组中的有关数据（地址和值）
  -----通过指针和数组名引用二维数组的各种表示方式。 
 */

int main() {
	int a[3][4]={1,3,5,7,9,11,13,15,17,19,21,23}; 
	printf("%d,%d\n",a,*a);					// 0行首地址，0行0列元素地址 
	printf("%d,%d\n",a[0],*(a+0));			// 0行0列元素地址 
	printf("%d,%d\n",&a[0],&a[0][0]);		// 0行首地址，0行0列元素地址 
	printf("%d,%d\n",a[1],a+1);				// 1行0列元素地址，1行首地址 
	printf("%d,%d\n",&a[1][0],*(a+1)+0);	// 1行0列元素地址 
	printf("%d,%d\n",a[2],*(a+2));			// 2行0列元素地址 
	printf("%d,%d\n",&a[2],a+2);			// 2行首地址 
	printf("%d,%d\n",a[1][0],*(*(a+1)+0));  // 1行0列元素的值 
	printf("%d,%d\n",*a[2],*(*(a+2)+0)); 	// 2行0列元素的值 
	printf("%d\n",*(*(a+2)));               // 2行0列元素的值 
	return 0;
}
